aivx/HEXAPOD_STM32F103RET6/HEXAPOD_STM32F103RET6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define L2_3_Pin GPIO_PIN_1
#define L2_3_GPIO_Port GPIOA
#define L2_2_Pin GPIO_PIN_2
#define L2_2_GPIO_Port GPIOA
#define L2_1_Pin GPIO_PIN_3
#define L2_1_GPIO_Port GPIOA
#define L3_2_Pin GPIO_PIN_6
#define L3_2_GPIO_Port GPIOA
#define L1_3_Pin GPIO_PIN_7
#define L1_3_GPIO_Port GPIOA
#define L1_2_Pin GPIO_PIN_0
#define L1_2_GPIO_Port GPIOB
#define L1_1_Pin GPIO_PIN_1
#define L1_1_GPIO_Port GPIOB
#define L6_1_Pin GPIO_PIN_6
#define L6_1_GPIO_Port GPIOC
#define L6_2_Pin GPIO_PIN_7
#define L6_2_GPIO_Port GPIOC
#define L6_3_Pin GPIO_PIN_8
#define L6_3_GPIO_Port GPIOC
#define L5_1_Pin GPIO_PIN_8
#define L5_1_GPIO_Port GPIOA
#define L5_2_Pin GPIO_PIN_9
#define L5_2_GPIO_Port GPIOA
#define L5_3_Pin GPIO_PIN_10
#define L5_3_GPIO_Port GPIOA
#define L3_3_Pin GPIO_PIN_11
#define L3_3_GPIO_Port GPIOA
#define POWER_MODULE_Pin GPIO_PIN_15
#define POWER_MODULE_GPIO_Port GPIOA
#define POWER_MODULE2_Pin GPIO_PIN_3
#define POWER_MODULE2_GPIO_Port GPIOB
#define L3_1_Pin GPIO_PIN_6
#define L3_1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
